[
  {
    "id": "01",
    "title": "Samsung Galazy z fold 3",
    "description": "<p>Esto es todo lo que querías en un teléfono inteligente 5G duradero y de primera calidad.1 Y lo hemos creado plegable para revelar una enorme</p>\n<p>&bull; una enorme pantalla en la que puedas ver<br />&bull; trabajar<br />&bull; divertirte como nunca antes<br /></p>",
    "price": {
      "value": 7000,
      "currencyCode": "S/"
    },
    "stock": 10,
    "categoryId": "Celulares",
    "pictureUrl": "https://images.samsung.com/ar/smartphones/galaxy-z-fold3-5g/buy/zfold3_carousel_mainsinglekv_mo.jpg"
  },
  {
    "id": "02",
    "title": "Samsung Galaxy Z flip 3",
    "description":"Esto es todo lo que querías en un teléfono inteligente 5G duradero y de primera calidad.1 Y lo hemos creado plegable para revelar una enorme pantalla en la que puedas ver, trabajar y divertirte como nunca antes",
    "price": {
      "value": 4000.99,
      "currencyCode": "S/"
    },
    "stock": 15,
    "categoryId": "Celulares",
    "pictureUrl": "https://m.media-amazon.com/images/I/716P9qOKcUL._AC_SL1500_.jpg"
  },
  {
    "id": "03",
    "title": "Samsung Galaxy s21 ultra",
    "description": "Presentamos el Galaxy S21 Ultra 5G. Diseñado con una sola cámara en los contornos de un marco para crear una revolución en la fotografía. Podrás hacer videos cinematográficos en 8K y tomar fotos épicas, todo al mismo tiempo. Además, cuenta con el conjunto de chips más rápido en un teléfono Galaxy, el vidrio más resistente, velocidad 5G y una batería que dura todo el día. “Ultra” realmente le rinde honor a su nombre.",
    "price": {
      "value": 5000.12,
      "currencyCode": "S/"
    },
    "stock": 20,
    "categoryId": "Celulares",
    "pictureUrl": "https://falabella.scene7.com/is/image/FalabellaPE/17892255_1?wid=800&hei=800&qlt=70"
  },
  {
    "id": "04",
    "title": "Huawei p50 pro",
    "description": "pantalla de 6,5 y 6,6 pulgadas con 90 y 120 Hz respectivamente. Su construcción es OLED en ambos casos y hay una única cámara frontal de 13 MPX junto con un sensor de huellas bajo la pantalla.",
    "price": {
      "value": 8000,
      "currencyCode": "S/"
    },
    "stock": 9,
    "categoryId": "Celulares",
    "pictureUrl": "https://consumer-img.huawei.com/content/dam/huawei-cbg-site/common/mkt/pdp/phones/p50-pro/list/black.png"
  },
  {
    "id": "05",
    "title": "Huawei p40 pro",
    "description":"El Huawei P40 Pro es un gran representante de los celulares Huawei. Entre las mejores características y especificaciones del Huawei P40 Pro está su visionario sistema de cámaras unificado; efectivamente, este móvil cuenta con cuatro cámaras fotográficas en la parte posterior, de 50 MP, 40 MP, 12 MP, y una cámara de profundidad 3D. Además, en la parte frontal tiene una cámara de 32 MP y una cámara de profundidad, dándote la mejor experiencia en fotografía en alta definición.",
    "price": {
      "value": 8000,
      "currencyCode": "S/"
    },
    "stock": 17,
    "categoryId": "Celulares",
    "pictureUrl": "https://consumer.huawei.com/content/dam/huawei-cbg-site/common/mkt/list-image/phones/p40-pro/p40-pro-silver.png"
  },
  {
    "id": "06",
    "title": "Huawei p30 pro",
    "description":" Haz zoom para explorar el misterio de lo celestial durante la noche, observa un águila sobre los árboles o examina los delicados detalles del cristal. Captura las mejores cosas en el momento exacto y crea tu visión para el futuro. El HUAWEI P30 Pro acentúa un nuevo esplendor en la fotografía de los smartphones.",
    "price": {
      "value": 2000,
      "currencyCode": "S/"
    },
    "stock": 30,
    "categoryId": "Celulares",
    "pictureUrl": "https://consumer.huawei.com/content/dam/huawei-cbg-site/common/mkt/list-image/phones/p30-pro/P30Pro_twilight.png"
  },
  {
    "id": "07",
    "title": "Huawei matebook d14",
    "description":"La relación de aspecto 3: 2, te da mayor verticalidad del espacio que el resto de dispositivos convencionales, lo que se convierte en algo ideal para diseñar, editar documentos o para navegar por internet. La pantalla tiene además certificado TÜV Rheinland3 para reducir los efectos de la luz azul4, por lo que podrás utilizarlo durante varias horas cómodamente sin cansar tu vista.",
    "price": {
      "value": 3500,
      "currencyCode": "S/"
    },
    "stock": 20,
    "categoryId": "Laptop",
    "pictureUrl": "https://i.blogs.es/6b4d5b/huawei2/450_1000.jpg"
  },
  {
    "id": "08",
    "title": "Huawei MateBook d15",
    "description":"Piérdete en las 15.6 pulgadas de la hermosa pantalla IPS FullView. Con una increíble relación pantalla-cuerpo de 87% y biseles ultradelgados que se han reducido a sólo 5.3 mm, es perfecta para ver películas, ser creativo o realizaralgún trabajo.",
    "price": {
      "value": 4000,
      "currencyCode": "S/"
    },
    "stock": 30,
    "categoryId": "Laptop",
    "pictureUrl": "https://acf.geeknetic.es/imgri/imagenes/tutoriales/2020/1718-huawei-matebook-d15/muestra.jpg?f=webp"
  },
  {
    "id": "09",
    "title": "Huawei MateBook d16",
    "description":"La pantalla HUAWEI FullView Display1 de 16.1” te brinda todo el espacio de pantalla que necesitas y más. Ideal para realizar múltiples tareas, el bisel ultra estrecho de 4.9 mm y la relación pantalla-cuerpo de 90% permiten que tu visión sea más amplia. Y también se vuelve más atrevido, gracias al color 100% sRGB2 y brillo máximo de 300 nits de su pantalla FHD.",
    "price": {
      "value": 5000,
      "currencyCode": "S/"
    },
    "stock": 18,
    "categoryId": "Laptop",
    "pictureUrl": "https://shop-cdncname.huawei.com/mx/product/6941487214273/group/800_800_07CAC6FBE59ACF32C72380D9D3E7EE0A56ED078956C387AA.webp"
  },
  {
    "id": "10",
    "title": "OMEN 15 By HP",
    "description":"No es solo otra laptop para juegos: es LA laptop para juegos. Obviamente, la OMEN 15 posee un potente procesador AMD y gráficos NVIDIA® en un marco compacto. ¿Ya mencionamos que ofrece rápida visualización y gran duración de la batería? Sí, tiene todo y puedes llevarla aún más allá gracias al OMEN Gaming Hub. Así que, disfruta de esas miradas de envidia mientras juegas; es lo que ocurre naturalmente con un hermoso equipo.",
    "price": {
      "value": 4500,
      "currencyCode": "S/"
    },
    "stock": 50,
    "categoryId": "Laptop",
    "pictureUrl": "https://d598hd2wips7r.cloudfront.net/catalog/product/cache/b3b166914d87ce343d4dc5ec5117b502/4/P/4PG18LA-1_T1578950178.png"
  },
  {
    "id": "11",
    "title": "Asus ZenBook Pro Duo 15",
    "description":"Zenbook (también conocido como ZenBook) es una familia de ultrabooks producidos por Asus. El primer Zenbook se empezó a comercializar en octubre de 2011 y la gama original de productos se enmendó y expandió durante 2012. ... Asus introdujo nuevos modelos con pantallas táctiles para aprovechar Windows 8 tras su lanzamiento.",
    "price": {
      "value": 8000,
      "currencyCode": "S/"
    },
    "stock": 30,
    "categoryId": "Laptop",
    "pictureUrl": "https://m.media-amazon.com/images/I/81Eub+aql9S._AC_SL1500_.jpg"
  },
  {
    "id": "12",
    "title": "Asus Fx Gaming",
    "description":"En los deportes electrónicos, la diferencia entre la victoria y la derrota puede reducirse a milisegundos. Las computadoras portátiles para juegos ROG Strix están perfeccionadas para brindarle una ventaja competitiva, brindando las altas velocidades de cuadro que necesita para una precisión incomparable y gráficos suaves como la seda para la mayoría de los juegos populares de la actualidad.",
    "price": {
      "value": 2000,
      "currencyCode": "S/"
    },
    "stock": 10,
    "categoryId": "Laptop",
    "pictureUrl": "https://compuusa.com.pe/9230/laptop-asus-fx506l-i7-10870h16gb512ssdv4gb156freedos.jpg"
  }
]
